app/Controllers/LoginHistoryController.php

SELECT *
FROM `login_history`
---
    public function index()
    {
        $loginHistoryModel = new LoginHistoryModel();
        $loginHistory = $loginHistoryModel->findAll();