app/Controllers/SignupCon.php

                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $userModel->save($data);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Jonell Mark Regala', 'mely@gmail.com', '$2y$10$S1b8EAqv2TyzE8RtHIM57uWF5U5/bRiSYiPDkM522uPlAU3qOGRrq')