app/Controllers/SigninCon.php

    public function loginAuth()
    {
        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'regalajohndavid@gmail.com'
 LIMIT 1

                    'ip_address' => file_get_contents('http://ipinfo.io/ip'),
                    'user_agent' => $_SERVER['HTTP_USER_AGENT'],
                ];
                $loginHistoryModel->insert($loginHistoryData);
---
INSERT INTO `login_history` (`user_id`, `login_time`, `ip_address`, `user_agent`) VALUES ('2', '2024-11-08 08:19:12', '180.190.214.6', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/130.0.0.0 Safari/537.36')

    public function logout()
    {
        $session = session();
        $userId = session()->get('id');
        // Update the logout time for the last login history record
        $loginHistoryModel = new LoginHistoryModel();
        $lastLoginHistoryRecord = $loginHistoryModel->where('user_id', $userId)->orderBy('id', 'desc')->first();
        $loginHistoryData = [
            'logout_time' => date('Y-m-d H:i:s'),
        ];
        $loginHistoryModel->update($lastLoginHistoryRecord['id'], $loginHistoryData);
---
SELECT *
FROM `login_history`
WHERE `user_id` = '2'
ORDER BY `id` DESC
 LIMIT 1
UPDATE `login_history` SET `logout_time` = '2024-11-08 08:19:27'
WHERE `login_history`.`id` IN ('11')

    public function sendPasswordResetLink()
    {
        $email = $this->request->getPost('email');
        $userModel = new UserModel();
        $data = $userModel->where('email', $email)->first();

        if ($data) {
            $token = bin2hex(random_bytes(50)); // Generate a secure token
            $expiryTime = date('Y-m-d H:i:s', strtotime('+1 hour')); // Token expiry time set to 1 hour

            // Store token in database (PasswordResetModel)
            $passwordResetModel = new PasswordResetModel();
            $passwordResetModel->save([
                'email' => $email,
                'token' => $token,
                'expires_at' => $expiryTime
            ]);
---
SELECT *
FROM `users`
WHERE `email` = 'regalajohndavid@gmail.com'
 LIMIT 1
INSERT INTO `password_resets` (`email`, `token`, `expires_at`) VALUES ('regalajohndavid@gmail.com', '3ab37d4a3cef64aab7425f7bdc32d8d209326267e14ed364008a02989be1bc8f91886655552d7c18788aaf2c6365483cc97a', '2024-11-08 09:18:17')

    public function resetPasswordForm($token)
    {
        $passwordResetModel = new PasswordResetModel();
        $resetRecord = $passwordResetModel->where('token', $token)->first();
---
SELECT *
FROM `password_resets`
WHERE `token` = '19e037381cd660b6a9ee8a383edd21ef83a6863953a0924e3992f52a477fa56085eda3e6e2568cc4a28c7e80b9f1add64d8e'
 LIMIT 1

    public function resetPassword()
    {
        $token = $this->request->getPost('token');
        $newPassword = $this->request->getPost('password');

        $passwordResetModel = new PasswordResetModel();
        $resetRecord = $passwordResetModel->where('token', $token)->first();

        if ($resetRecord && strtotime($resetRecord['expires_at']) > time()) {
            // Update the user's password
            $userModel = new UserModel();
            $userModel->where('email', $resetRecord['email'])->set(['password' => password_hash($newPassword, PASSWORD_DEFAULT)])->update();

            // Delete the reset token from the database
            $passwordResetModel->where('token', $token)->delete();
---
SELECT *
FROM `password_resets`
WHERE `token` = '19e037381cd660b6a9ee8a383edd21ef83a6863953a0924e3992f52a477fa56085eda3e6e2568cc4a28c7e80b9f1add64d8e'
 LIMIT 1
UPDATE `users` SET `password` = '$2y$10$Oh302AItt0gOWCys4PN7RerhvRKe/iYAddhNvsjVDG.dFNq5CaCE2'
WHERE `email` = 'regalajohndavid@gmail.com'
DELETE FROM `password_resets`
WHERE `token` = '19e037381cd660b6a9ee8a383edd21ef83a6863953a0924e3992f52a477fa56085eda3e6e2568cc4a28c7e80b9f1add64d8e'